src/tr069/samples/tr069_set_parameter_attributes_10param_req.xml

<soapenv:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
      <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
      <cwmp:SetParameterAttributes>
         <ParameterList soap:arrayType="cwmp:SetParameterAttributeStruct[10]">
	     <ParameterList>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.LANDeviceNumberOfEntries</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.WANDeviceNumberOfEntries</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
		 <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceSummary</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceInfo.</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
		 <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.ManagementServer.</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.Time.</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
		 <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceInfo.Manufacturer</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceInfo.Description</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
		 <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceInfo.ManufacturerOUI</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	         <cwmp:SetParameterAttributesStruct>
	             <Name>InternetGatewayDevice.DeviceInfo.ModelName</Name>
	             <NotificationChange>1</NotificationChange>
	             <Notification>2</Notification>
	             <AccessListChange>1</AccessListChange>
	             <cwmp:AccessList>
	               <string>Subscriber</string>
	             </cwmp:AccessList>
	         </cwmp:SetParameterAttributesStruct>
	     </ParameterList>
        </cwmp:SetParameterAttributes>
      </soapenv:Body>
</soapenv:Envelope>
